In [1]:
import IPython

import psycopg2 as pg
import pandas as pd
import numpy as np
from sqlalchemy import create_engine

Как выглядит ERD:

In [95]:

src="https://drawsql.app/teams/erd-mainor/diagrams/marketplace-erd/embed"

IPython.display.IFrame(src, width="100%",
height="500px",
style="box-shadow: 0 2px 8px 0 rgba(63,69,81,0.16); border-radius:15px;",
allowtransparency="true", 
allowfullscreen="true", 
scrolling="no", 
title="Embedded DrawSQL IFrame", 
frameborder="0")

In [3]:
%load_ext sql

In [4]:
host = 'localhost'
database = 'Marketplace_ERD'
user = 'hw_check'
password = 'X7pl2'

connection_string = f'postgresql://{user}:{password}@{host}/{database}'

In [5]:
%sql $connection_string

### Создание БД:

In [83]:
%%sql

CREATE TABLE Buy_step(
    buy_step_id INTEGER NOT NULL,
    buy_id INTEGER NOT NULL,
    step_id INTEGER NOT NULL,
    date_of_step DATE NOT NULL
);
ALTER TABLE
    Buy_step ADD PRIMARY KEY(buy_step_id);
CREATE TABLE Step(
    step_id INTEGER NOT NULL,
    name_step VARCHAR(30) NOT NULL
);
ALTER TABLE
    Step ADD PRIMARY KEY(step_id);
CREATE TABLE Buy_description(
    description_id INTEGER NOT NULL,
    description VARCHAR(30) NULL,
    type_of_delivery VARCHAR(30) NOT NULL
);
ALTER TABLE
    Buy_description ADD PRIMARY KEY(description_id);
CREATE TABLE Buy(
    buy_id INTEGER NOT NULL,
    description_id INTEGER NOT NULL,
    client_id INTEGER NOT NULL,
    product_id INTEGER NOT NULL,
    amount INTEGER NOT NULL,
    payment INTEGER NOT NULL
);
ALTER TABLE
    Buy ADD PRIMARY KEY(buy_id);
CREATE TABLE Address(
    address_id INTEGER NOT NULL,
    address VARCHAR(30) NOT NULL,
    city_id INTEGER NOT NULL,
    client_id INTEGER NOT NULL,
    days_delivery INTEGER NOT NULL
);
ALTER TABLE
    Address ADD PRIMARY KEY(address_id);
CREATE TABLE Clients(
    client_id INTEGER NOT NULL,
    client_name VARCHAR(30) NOT NULL,
    telephone VARCHAR(12) NOT NULL
);
ALTER TABLE
    Clients ADD PRIMARY KEY(client_id);
CREATE TABLE Products(
    product_id INTEGER NOT NULL,
    category_id INTEGER NOT NULL,
    store_id INTEGER NOT NULL,
    price INTEGER NOT NULL,
    amount INTEGER NOT NULL,
    title VARCHAR(30) NOT NULL
);
ALTER TABLE
    Products ADD PRIMARY KEY(product_id);
CREATE TABLE City(
    city_id INTEGER NOT NULL,
    city_name VARCHAR(30) NOT NULL,
    sellers_amount INTEGER NOT NULL
);
ALTER TABLE
    City ADD PRIMARY KEY(city_id);
CREATE TABLE Sellers(
    store_id INTEGER NOT NULL,
    store_name VARCHAR(30) NOT NULL,
    city_id INTEGER NOT NULL
);
ALTER TABLE
    Sellers ADD PRIMARY KEY(store_id);
CREATE TABLE Category(
    category_id INTEGER NOT NULL,
    category_name VARCHAR(30) NOT NULL
);
ALTER TABLE
    Category ADD PRIMARY KEY(category_id);
ALTER TABLE
    Buy_step ADD CONSTRAINT buy_step_buy_id_foreign FOREIGN KEY(buy_id) REFERENCES Buy(buy_id);
ALTER TABLE
    Buy_step ADD CONSTRAINT buy_step_step_id_foreign FOREIGN KEY(step_id) REFERENCES Step(step_id);
ALTER TABLE
    Buy ADD CONSTRAINT buy_description_id_foreign FOREIGN KEY(description_id) REFERENCES Buy_description(description_id);
ALTER TABLE
    Buy ADD CONSTRAINT buy_client_id_foreign FOREIGN KEY(client_id) REFERENCES Clients(client_id);
ALTER TABLE
    Buy ADD CONSTRAINT buy_product_id_foreign FOREIGN KEY(product_id) REFERENCES Products(product_id);
ALTER TABLE
    Address ADD CONSTRAINT address_city_id_foreign FOREIGN KEY(city_id) REFERENCES City(city_id);
ALTER TABLE
    Address ADD CONSTRAINT address_client_id_foreign FOREIGN KEY(client_id) REFERENCES Clients(client_id);
ALTER TABLE
    Products ADD CONSTRAINT products_store_id_foreign FOREIGN KEY(store_id) REFERENCES Sellers(store_id);
ALTER TABLE
    Sellers ADD CONSTRAINT sellers_city_id_foreign FOREIGN KEY(city_id) REFERENCES City(city_id);
ALTER TABLE
    Products ADD CONSTRAINT products_category_id_foreign FOREIGN KEY(category_id) REFERENCES Category(category_id);

 * postgresql://hw_check:***@localhost/Marketplace_ERD
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.

[]

### Добавление данных:

In [84]:
%%sql

insert into Category(category_id, category_name) values
    (1, 'Электроника'),
    (2, 'Одежда'),
    (3, 'Мебель');
    
    
insert into City(city_id, city_name, sellers_amount) values
    (1, 'Moscow', 5),
    (2, 'SPB', 2),
    (3, 'Kazan', 2);
    

insert into Sellers(store_id, store_name, city_id) values
    (1, 'Xiaomi', 1),
    (2, 'Samsung', 1),
    (3, 'Adidas', 2),
    (4, 'GJ', 1),
    (5, 'LEVIS', 1),
    (6, 'Ormatek', 2),
    (7, 'Sokoltec', 1),
    (8, 'Samsung', 3),
    (9, 'Xiaomi', 3);
    
    
insert into Products(product_id, category_id, store_id, price, amount, title) values
    (1, 1, 1, 8235, 56, 'Xiaomi Redmi 9C 3/64'),
    (2, 1, 1, 25999, 14, 'Xiaomi MI TV P1 43'),
    (3, 1, 9, 25999, 14, 'Xiaomi MI TV P1 43'),
    (4, 1, 9, 4369, 5, 'Xiaomi Redmi Watch 2 Lite GL'),
    
    (5, 1, 2, 64063, 34, 'Samsung Galaxy S22'),
    (6, 1, 8, 86025, 22, 'Samsung Galaxy Tab S8 Ultra'),
    
    (7, 2, 3, 29999, 3, 'adidas 4DFWD'),
    (8, 2, 3, 6399, 3, 'adidas Ultimashow'),
    (9, 2, 4, 3047, 42, 'Jeans tlx'),
    (10, 2, 4, 5831, 2, 'Hoodie xt4'),
    (11, 2, 5, 4900, 12, 'New LEVIS HM polo'),
    (12, 2, 5, 2088, 57, 'LEVIS Turner'),
    (13, 2, 5, 23180, 11, 'Coat LEVIS'),
    
    (14, 3, 6, 47189, 93, 'Optima Classic'),
    (15, 3, 6, 3948, 173, 'Ormatek SLEEP'),
    (16, 3, 7, 5469, 1155, 'Chair set x2'),
    (17, 3, 7, 6691, 119, 'Gaiming chair sokt'),
    (18, 3, 7, 3521, 109, 'Desk table');
    

insert into Clients(client_id, client_name, telephone) values
    (1, 'N - U Ludi', +79951853464),
    (2, 'Gunnar', +79851196212),
    (3, 'Square bit', +79341476919),
    (4, 'Ni La Da', +79301992030),
    (5, 'Silkovsky', +7910181724);
    
    
insert into Address(address_id, address, city_id, client_id, days_delivery) values
    (1, 'Malaya Bronnaya St, 31', 1, 1, 1),
    (2, 'Monetchikovskiy Pereulok, 81', 1, 2, 1),
    (3, 'Monetchikovskiy Pereulok, 29', 1, 3, 2),
    (4, 'Myasnitskaya Ulitsa, 63', 2, 4, 2),
    (5, 'Taganskaya Ulitsa, 16', 3, 5, 4);
    

insert into Buy_description(description_id, description, type_of_delivery) values
    (1, 'Первая половина дня', 'To_household'),
    (2, 'Вторая половина дня', 'To_household'),
    (3, 'Без разницы', 'To_household'),
    (4, null, 'To_postamat');
    

insert into Buy(buy_id, description_id, client_id, product_id, amount, payment) values
    (1, 1, 1, 2, 1, 25999),
    (2, 1, 1, 5, 2, 128126),
    (3, 4, 2, 13, 1, 23180),
    (4, 4, 3, 7, 1, 29999),
    (5, 4, 3, 8, 1, 6399),
    (6, 2, 4, 14, 1, 47189),
    (7, 2, 4, 15, 1, 3948),
    (8, 4, 5, 5, 4, 256252),
    (9, 4, 5, 6, 2, 172050),
    (10, 4, 1, 16, 15, 82035);
    
    
insert into Step(step_id, name_step) values
    (1, 'Перемещено в корзину'),
    (2, 'Оплачено'),
    (3, 'Запрошен возврат');
    
    
insert into Buy_step(buy_step_id, buy_id, step_id, date_of_step) values
    (1, 1, 1, '2022-12-05'),
    (2, 1, 2, '2022-12-07'),
    (3, 2, 1, '2022-12-08'),
    (4, 2, 2, '2022-12-15'),
    (5, 3, 1, '2022-12-05'),
    (6, 3, 2, '2022-12-05'),
    (7, 3, 3, '2022-12-06'),
    (8, 4, 1, '2022-12-05'),
    (9, 4, 2, '2022-12-05'),
    (10, 5, 1, '2022-12-06'),
    (11, 6, 1, '2022-12-07'),
    (12, 7, 1, '2022-12-08'), 
    (13, 7, 2, '2022-12-11'),
    (14, 7, 3, '2022-12-12'),
    (15, 8, 1, '2022-12-06'),
    (16, 9, 1, '2022-12-07'),
    (17, 10, 1, '2022-12-06');

 * postgresql://hw_check:***@localhost/Marketplace_ERD
3 rows affected.
3 rows affected.
9 rows affected.
18 rows affected.
5 rows affected.
5 rows affected.
4 rows affected.
10 rows affected.
3 rows affected.
17 rows affected.

[]

### Выполнение запросов:

1) Вывести все заказы пользователя с именем 'N - U Ludi'

In [6]:
%%sql
    
select *
from Buy b
where client_id = (select client_id from Clients where client_name = 'N - U Ludi')

 * postgresql://hw_check:***@localhost/Marketplace_ERD
3 rows affected.

[(1, 1, 1, 2, 1, 25999), (2, 1, 1, 5, 2, 128126), (10, 4, 1, 16, 15, 82035)]

2) Вывести суммарные траты каждого пользователя в порядке убывания

In [95]:
%%sql

select client_name, sum(payment)
from Clients c left join Buy b on c.client_id = b.client_id
group by client_name
order by 2 desc

 * postgresql://hw_check:***@localhost/Marketplace_ERD
5 rows affected.

[('Silkovsky', 428302),
 ('N - U Ludi', 236160),
 ('Ni La Da', 51137),
 ('Square bit', 36398),
 ('Gunnar', 23180)]

3) Вывести самый дорогой заказ с его стоимостью

In [102]:
%%sql

with t1 as ( 
    select buy_id, max(payment) ans
    from Buy b 
    group by buy_id
)

select buy_id, ans from t1 where ans = (select max(ans) from t1)

 * postgresql://hw_check:***@localhost/Marketplace_ERD
1 rows affected.

[(8, 256252)]

4) Вывести из какого продукта состоял самый дорогой заказ, полученный в вопросе 3

In [108]:
%%sql

with t1 as ( 
    select buy_id, max(payment) ans
    from Buy b 
    group by buy_id
),

t2 as (
    select buy_id, ans 
    from t1 
    where ans = (select max(ans) from t1)
)

select title, b.amount from Buy b left join Products p on b.product_id = p.product_id
where buy_id = (select buy_id from t2)

 * postgresql://hw_check:***@localhost/Marketplace_ERD
1 rows affected.

[('Samsung Galaxy S22', 4)]

5) Вывести сколько покупок было сделано в каждую дату

In [39]:
%%sql

with t1 as (
    select buy_id
    from Buy_step bs
    where step_id = 2
    group by buy_id

    except 

    select buy_id
    from Buy_step bss
    where step_id = 3
    group by buy_id)


select date_of_step, count(t1.buy_id) 
from Buy_step bs left join t1 on bs.buy_id = t1.buy_id and bs.step_id = 2
group by date_of_step
order by 1

 * postgresql://hw_check:***@localhost/Marketplace_ERD
7 rows affected.

[(datetime.date(2022, 12, 5), 1),
 (datetime.date(2022, 12, 6), 0),
 (datetime.date(2022, 12, 7), 1),
 (datetime.date(2022, 12, 8), 0),
 (datetime.date(2022, 12, 11), 0),
 (datetime.date(2022, 12, 12), 0),
 (datetime.date(2022, 12, 15), 1)]

6.1) Вывести какие покупки были добавлены в корзину, но не оплачены

In [60]:
%%sql

with t1 as (
    select buy_id
    from Buy_step bs
    group by buy_id
    having max(step_id) = 1
)

select t1.buy_id, title, b.amount, payment
from Buy b right join t1 on b.buy_id = t1.buy_id 
left join Products p on b.product_id = p.product_id

 * postgresql://hw_check:***@localhost/Marketplace_ERD
5 rows affected.

[(9, 'Samsung Galaxy Tab S8 Ultra', 2, 172050),
 (5, 'adidas Ultimashow', 1, 6399),
 (10, 'Chair set x2', 15, 82035),
 (6, 'Optima Classic', 1, 47189),
 (8, 'Samsung Galaxy S22', 4, 256252)]

7) Из какой категории было совершено больше всего покупок, а из какой меньше всего

In [72]:
%%sql

with t1 as (
    select b.buy_id 
    from Buy b inner join Buy_step bs on b.buy_id = bs.buy_id 
    group by b.buy_id
    having max(step_id) = 2
),

t2 as (
    select category_name, count(*) ans
    from Category c left join Products p on c.category_id = p.category_id
    left join Buy b on p.product_id = b.product_id
    where buy_id in (select * from t1)
    group by category_name
    order by 2 desc
)

select category_name, ans
from t2 where ans = (select max(ans) from t2) 
or ans = (select min(ans) from t2)

 * postgresql://hw_check:***@localhost/Marketplace_ERD
2 rows affected.

[('Электроника', 2), ('Одежда', 1)]

8) Вывести самые популярные магазины (у которых совершено больше всего покупок)

In [88]:
%%sql

with t1 as (
    select b.buy_id 
    from Buy b inner join Buy_step bs on b.buy_id = bs.buy_id 
    group by b.buy_id
    having max(step_id) = 2
), 

t2 as (
    select store_name, count(*) c1
    from Sellers s left join Products p on s.store_id = p.store_id
    inner join Buy b on p.product_id = b.product_id
    where buy_id in (select * from t1)
    group by store_name
)

select store_name from t2 where c1 = (select max(c1) from t2)

 * postgresql://hw_check:***@localhost/Marketplace_ERD
3 rows affected.

[('Adidas',), ('Samsung',), ('Xiaomi',)]

9) Самый прибыльный магазин

In [93]:
%%sql

with t1 as (
    select b.buy_id 
    from Buy b inner join Buy_step bs on b.buy_id = bs.buy_id 
    group by b.buy_id
    having max(step_id) = 2
)

select store_name, sum(payment)
from Sellers s left join Products p on s.store_id = p.store_id
left join Buy b on p.product_id = b.product_id
where buy_id in (select * from t1)
group by store_name
order by 2 DESC
limit 1

 * postgresql://hw_check:***@localhost/Marketplace_ERD
1 rows affected.

[('Samsung', 128126)]

---